{'search_metadata': {'id': '65daaf3ac90e0a3c5f723b90', 'status': 'Success', 'json_endpoint': 'https: //serpapi.com/searches/1488d593be63b190/65daaf3ac90e0a3c5f723b90.json', 'created_at': '2024-02-25 03:08:42 UTC', 'processed_at': '2024-02-25 03:08:42 UTC', 'google_jobs_url': 'https://www.google.com/search?q=software+engineer&ibp=htl;jobs&uule=w+CAIQICIZTmV3IFlvcmssTlksVW5pdGVkIFN0YXRlcw&hl=en', 'raw_html_file': 'https://serpapi.com/searches/1488d593be63b190/65daaf3ac90e0a3c5f723b90.html', 'total_time_taken': 1.36}, 'search_parameters': {'q': 'software engineer', 'engine': 'google_jobs', 'location_requested': 'New York, NY', 'location_used': 'New York,NY,United States', 'google_domain': 'google.com', 'hl': 'en'}, 'jobs_results': [{'title': 'Software Engineer', 'company_name': 'Democracy Works', 'location': '  New York, NY   ', 'via': 'via Greenhouse', 'description': "Location: Remote within the US\n\nSalary Range...\n• Most regions in the United States: 104,400- 111,600\n• California-specific: 104,400- 124,000\n• NYC-specific: 116,000- 124,000\n\nOffers will vary based on experience and location-based cost-of-living calculations.\n• Level: 3\n• Supervisory role: N\n• Classification: Exempt, full time\n\nAbout our organization:\n\nDemocracy Works is a nonpartisan, nonprofit organization that collaborates with election officials, leading tech platforms, and world-class partners to drive voter access and participation. We help Americans vote by providing reliable, useful voting guidance through the sites, apps and groups they trust. This includes TurboVote, Democracy Works Election Data, the Voting Information Project (VIP), and Ballot Scout. We also co-founded the Civic Alliance alongside the CAA Foundation. Democracy Works is committed to diversity and inclusion in everything we do and aspires to have a team that's representative of the voters we serve.\n\nThe impact you’ll make:\n\nOur teams work closely together to build the next generation of tools for both voters and election administrators. Our suite of tools include TurboVote, the Voting Information Project (VIP), and How To Vote. To power these tools we use a variety of languages such as: JavaScript, TypeScript, Python, Ruby, Clojure. We employ a microservices architecture and run our applications in AWS. We are evolving our program offerings to deliver new experiences that increase our organization’s impact on voters and election administrators.\n\nAs a Software Engineer on the team, you will:\n• Collaboratively solve problems, by researching solutions, writing high quality, supportable code\n• Work on projects of moderate to large scope which will require navigating ambiguity by researching and discussing solutions with the team\n• Enhance applications by identifying opportunities for improvement, making recommendations and designing and implementing systems\n• Work closely with product and design teams to iterate on and refine product requirements\n• Provide technical mentorship to members of your team\n• Execute other tasks as may be assigned\n\nSoftware You are someone with:\n• At least 2 years of hands-on experience delivering technical projects using a functional, object-oriented or scripting programming language such as JavaScript, Typescript, Ruby, Python, Clojure, etc.\n• Understanding of performance, scalability, and security concerns\n• Experience with automated testing frameworks\n• Experience working with relational databases and relational data modeling or NoSQL databases.\n• Experience with distributed version control system (such as Git or Mercurial) and its advanced features\n• Hands-on experience deploying and working with web applications in the cloud and automating DevOps processes\n• Experience thinking critically about software systems and understanding tradeoffs\n\nIt’s a plus if:\n• You have experience working with public facing web applications, APIs, or Software as a Service (SaaS) applications\n• You have experience in at least one functional programming language with a desire to learn Clojure/ClojureScript\n• You have experience working with geospatial data and lookups\n\nHow we work\n\nBecause elections take place everywhere, our employees work from all across the country. We embrace working remotely as the default. Our positions require regular, daily use of a computer (including the use of G-Suite and Slack) to conduct work and communicate with colleagues. We also have regular operating hours (10 am to 6 pm Eastern, Monday to Friday).\n\nFor those who prefer to work from an office, we are headquartered in Brooklyn, NY. We are happy to share more details about the office, including accessibility information, as on-site visits are planned.\n\nThere may be travel for occasional staff retreats or meetings as part of certain roles.\n\nBenefits\n\nAs a member of the team, some of the benefits you’ll enjoy include:\n• 100% employer-paid medical, dental, and vision option for you and your dependents\n• 12 floating holidays and 25 days of Paid Time Off (PTO) per year\n• 12 weeks of paid parental leave\n• $1,000 per year towards professional development activities\n\nWe also offer a 403(b) retirement plan, stipends for equipment and internet reimbursement, and annual Calm or Headspace subscription reimbursements.\n\nTo Apply\n\nPlease attach your resume and answers to the following questions:\n• How did you find this job listing?\n• Why are you interested in this role and working at Democracy Works?\n• Describe a bug you had a primary role in fixing. How did you troubleshoot and resolve the issue?\n• Are you authorized to work lawfully in the United States for Democracy Works?\n\nOur Commitment to Diversity, Equity & Inclusion (DEI) in Hiring\n\nDemocracy Works is an Equal Opportunity Employer and does not discriminate against applicants based on race, religion, color, disability, medical condition, legally protected genetic information, national origin, gender, sexual orientation, marital status, gender identity or expression, sex (including pregnancy, childbirth or related medical conditions), age, veteran status or other legally protected characteristics.\n\nAs part of our application, you’ll see an optional form used to collect U.S. Equal Employment Opportunity Commission (EEOC) demographic information. Please note the categories used in this survey are set by the EEOC and may not reflect all existing categories.The data collected in this form is anonymized and is used in our EEOC reporting and in ongoing assessment of our recruitment practices.\n\nDemocracy Works follows the I-9 requirements of the Immigration Reform and Control Act of 1986. Immigration sponsorship is not available for this position, and you must possess your own work authorization in the U.S. now and in the future to continue working in this position.\n\nPlease reach out to hr@democracy.works if you have any questions about our process or if you need an accommodation for a medical condition during the hiring process", 'job_highlights': [{'title': 'Qualifications', 'items': ['At least 2 years of hands-on experience delivering technical projects using a functional, object-oriented or scripting programming language such as JavaScript, Typescript, Ruby, Python, Clojure, etc', 'Understanding of performance, scalability, and security concerns', 'Experience with automated testing frameworks', 'Experience working with relational databases and relational data modeling or NoSQL databases', 'Experience with distributed version control system (such as Git or Mercurial) and its advanced features', 'Hands-on experience deploying and working with web applications in the cloud and automating DevOps processes', 'Experience thinking critically about software systems and understanding tradeoffs', 'You have experience working with public facing web applications, APIs, or Software as a Service (SaaS) applications', 'You have experience in at least one functional programming language with a desire to learn Clojure/ClojureScript', 'You have experience working with geospatial data and lookups']}, {'title': 'Responsibilities', 'items': ['Collaboratively solve problems, by researching solutions, writing high quality, supportable code', 'Work on projects of moderate to large scope which will require navigating ambiguity by researching and discussing solutions with the team', 'Enhance applications by identifying opportunities for improvement, making recommendations and designing and implementing systems', 'Work closely with product and design teams to iterate on and refine product requirements', 'Provide technical mentorship to members of your team', 'Execute other tasks as may be assigned']}, {'title': 'Benefits', 'items': ['Most regions in the United States: 104,400- 111,600', 'California-specific: 104,400- 124,000', 'NYC-specific: 116,000- 124,000', '100% employer-paid medical, dental, and vision option for you and your dependents', '12 floating holidays and 25 days of Paid Time Off (PTO) per year', '12 weeks of paid parental leave', '$1,000 per year towards professional development activities', 'We also offer a 403(b) retirement plan, stipends for equipment and internet reimbursement, and annual Calm or Headspace subscription reimbursements']}], 'related_links': [{'link': 'http://democracy.works/', 'text': 'democracy.works'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Democracy+Works&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCN8J', 'text': 'See web results for Democracy Works'}], 'extensions': ['3 days ago', 'Full-time', 'No degree mentioned', 'Health insurance', 'Dental insurance', 'Paid time off'], 'detected_extensions': {'posted_at': '3 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoieHJXbzlXamx5NElhY1pFakFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTUxVjJoamEwZzNiMmQyZVhoV05rTlVUMGhaTmtWeWJHNW1ibk5sY25OUmExWkVXRFJLTFdVdFMxUnFNa2swWWpFMGNqZHZSbUZ6U1c1SU9GTkZhWGRHYmpsQldERkdXamN5VFRsNVdVOXFkRk5SZG1ZMVMzZHZMV3RrZFRkaGEwZEtabTl5YW5OQlJVSkRlV1JuYTJoVVZrcHBSM0pEUkhoNVFscDBWRTV2YlZScFoxaEtRbkF0T1ZCT1NGaG9ZMEZCZUZablRVTmxRekpaTnkxRVVuZGlkM0pYVUZFd1duYzFiMUpzVlRKSlptZGtWMkpzWm5NdFdsWkpha3BaUmpkV1ZITndlV0ZzWVMxS1ZFMWlUbXBRVTJOa2JqRXlZM3BKTWxCaVkxVnJRUklYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5XRnhka3hJWVMxRmMwSXdjR1pZUTNGTWJEVkVhbUZzZG1KMWNGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiLm5GZzJlYntmb250LXdlaWdodDo1MDB9LkJpNkRkY3tmb250LXdlaWdodDo1MDB9QXBwbHkgb24gR3JlZW5ob3VzZSIsImxpbmsiOiJodHRwczovL2JvYXJkcy5ncmVlbmhvdXNlLmlvL2RlbW9jcmFjeXdvcmtzL2pvYnMvNTg5NjM1NDAwMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}, {'title': 'Software Engineer', 'company_name': 'Columbia University', 'location': '  New York, NY   ', 'via': 'via Careers At Columbia - Columbia University', 'description': "• Job Type: Officer of Administration\n• Bargaining Unit:\n• Regular/Temporary: Regular...\n• End Date if Temporary:\n• Hours Per Week: 35\n• Standard Work Schedule: Monday - Friday\n• Building: PH-20\n• Salary Range: $86,700 - $95,000\n\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to departmental budgets, qualifications, experience, education, licenses, specialty, and training. The above hiring range represents the University's good faith and reasonable estimate of the range of possible compensation at the time of posting.\n\nPosition Summary\n\nThe Department of Biomedical Informatics (DBMI) at Columbia University has an immediate opening for a talented and self-motivated Software Engineer who can succeed in a collaborative work environment. The ideal candidate should have experience in developing pipelines to extract and process clinical data in real time between relational databases containing health records and applications that use the FHIR and SMART standards (both backend and provider facing applications).\n\nAdditionally, experience with docker platform and health system information security requirements would be beneficial. The candidate will be responsible for the entire software architecture for one or more large multi-site research projects, including prospective informatics intervention studies. Additionally, experience with clinical decision support and/or data science methods would be beneficial. The ideal candidate will have professional experience in several programming languages, databases, and development environments. The successful candidate will contribute to the development and evaluation of data science driven, real-time informatics interventions, including open-source solutions, together with a community of international researchers.\n\nThe current available position is grant-funded under several NIH, AHRQ and foundation funded grants. The Software Engineer’s time would be shared across several grant funded projects focused on foundational and applied clinical informatics research, with each grant led by either Principal Investigator Dr. Sarah Rossetti or Dr. Soojin Park.\n\nColumbia University's Department of Biomedical Informatics is internationally recognized as one of the best programs of its kind. Our mission is to improve health for society by focusing on discovery and impact: we develop new informatics methods, enrich the biomedical knowledge base, and enhance the health of the population.\n\nResponsibilities\n\n1. Software and system specifications, design, implementation, and testing (60%)\n\n2. Application deployment and configuration (30%)\n\n3. Communicate with technical individuals at various grant sites (10%)\n\n4. Querying enterprise data warehouse to support research activities\n\nMinimum Qualifications\n\nBachelor’s degree or equivalent in education and experience, plus four years of related experience.\n\nOther Requirements\n• Great communication skills.\n• Extensive knowledge of relational databases, SQL, and EHR data structures\n• Experience with FHIR and SMART standards, AWS cloud services, electronic health record data, software container programming (Kubernetes, Docker), technology, information management, relational database design and development, including programming, managing and maintaining data systems, and Experience using and maintaining systems across a variety of platforms (Windows, Linux, AWS, etc.)\n• Proficient with Python programming.\n• Related experience of statistical software, such as R, SAS or SPSS, Matlab and big data management processes. Knowledge of relational and other databases (Oracle, SQL, PL/SQ) is also required.\n• Prior experience in quantitative research.\n• Ability to work cross-functionally as part of a team, as well as an individual contributor and to think independently as well as perform tasks according to the directions of project leaders.\n• Must demonstrate good decision-making skills, be able to call out conflicting issues when they arise and possess knowledge of how and when to follow through on issues.\n• Good interpersonal skills and the ability to exercise leadership in data analysis activities as part of a research project team.\n\nEqual Opportunity Employer / Disability / Veteran\n\nColumbia University is committed to the hiring of qualified local residents", 'job_highlights': [{'title': 'Qualifications', 'items': ['The ideal candidate should have experience in developing pipelines to extract and process clinical data in real time between relational databases containing health records and applications that use the FHIR and SMART standards (both backend and provider facing applications)', 'Additionally, experience with docker platform and health system information security requirements would be beneficial', 'The candidate will be responsible for the entire software architecture for one or more large multi-site research projects, including prospective informatics intervention studies', 'Additionally, experience with clinical decision support and/or data science methods would be beneficial', 'The ideal candidate will have professional experience in several programming languages, databases, and development environments', 'The successful candidate will contribute to the development and evaluation of data science driven, real-time informatics interventions, including open-source solutions, together with a community of international researchers', 'Bachelor’s degree or equivalent in education and experience, plus four years of related experience', 'Great communication skills', 'Extensive knowledge of relational databases, SQL, and EHR data structures', 'Experience with FHIR and SMART standards, AWS cloud services, electronic health record data, software container programming (Kubernetes, Docker), technology, information management, relational database design and development, including programming, managing and maintaining data systems, and Experience using and maintaining systems across a variety of platforms (Windows, Linux, AWS, etc.)', 'Proficient with Python programming', 'Related experience of statistical software, such as R, SAS or SPSS, Matlab and big data management processes', 'Knowledge of relational and other databases (Oracle, SQL, PL/SQ) is also required', 'Prior experience in quantitative research', 'Ability to work cross-functionally as part of a team, as well as an individual contributor and to think independently as well as perform tasks according to the directions of project leaders', 'Must demonstrate good decision-making skills, be able to call out conflicting issues when they arise and possess knowledge of how and when to follow through on issues', 'Good interpersonal skills and the ability to exercise leadership in data analysis activities as part of a research project team']}, {'title': 'Responsibilities', 'items': ['Hours Per Week: 35', 'Software and system specifications, design, implementation, and testing (60%)', 'Application deployment and configuration (30%)', 'Communicate with technical individuals at various grant sites (10%)', 'Querying enterprise data warehouse to support research activities']}, {'title': 'Benefits', 'items': ['Salary Range: $86,700 - $95,000', 'The salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to departmental budgets, qualifications, experience, education, licenses, specialty, and training', "The above hiring range represents the University's good faith and reasonable estimate of the range of possible compensation at the time of posting"]}], 'related_links': [{'link': 'https://www.columbia.edu/', 'text': 'columbia.edu'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Columbia+University&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCLUK', 'text': 'See web results for Columbia University'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTFRt0P9a0uxQIyeNmROuIli_EyMuKIeWo_TXhg&s=0', 'extensions': ['Full-time'], 'detected_extensions': {'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiU2g4V0JvbkZBWlZRd1pNMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTUxVjJoamJWWkNjemhWUVhaSE0xZGlNbk5aVjFCdlJtYzRkRGxqTkZOWmJIRkhWaloxV1ZkZmRFVkZkbmszVlU1eWFGUlFTRlJtWDI0MFJqbHhMVXA2VkZOeExVcGZXVTlrWTJweGVFbG1jVjh5Y1dJNE5tcG1PUzFMVkdoZmQyeE1kbGM1YzJzeVlqVlNhR2RmYVZaRGFHcG9NbkE1ZGw5U1NWTm9kVk5uUW5sdlluSjJXRWg1VVVkNGJYRTBZa1JuVURBMlpFdEplWFJmVUhNNGFteEJha0ZWZEdvNVZUWkhVbUp0YVRZMmFHUmxSRXhwY0VGWWVIVjJTbkZzVGxwS1FsUmlZbWRsUlVvMWRrRndUMVl6ZUVkaGJFa3RNVVZSTkdSU1gwZEdkeElYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5XRnFNVkp0Y214VVUwZDFibVpJTlVSa1dsSmxiSFZtY21wbmJtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ2FyZWVycyBBdCBDb2x1bWJpYSAtIENvbHVtYmlhIFVuaXZlcnNpdHkiLCJsaW5rIjoiaHR0cHM6Ly9vcHBvcnR1bml0aWVzLmNvbHVtYmlhLmVkdS9qb2JzLzBlMmJlODk5LWMwNWUtNDdmNS05NjBlLWU5ZDg4NWQ4ZjA0YT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}, {'title': 'Software Engineer', 'company_name': 'Datadog', 'location': '  New York, NY   ', 'via': 'via Datadog Careers', 'description': "About Datadog:\n\nWe're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to... solve hard problems the right way.\n\nYou will:\n• Solve a scaling bottleneck in a critical service\n• Deploy a new feature to production, progressively rolling it out with feature flags\n• Investigate and fix a production issue from a service your team owns\n• Design a way to scale up a service for more traffic\n• With your team, plan the most important projects to work on next\n\nRequirements:\n• You have significant experience in one or more languages\n• You value code simplicity and performance\n• You can design architecture to solve problems at high scale\n• You have a BS/MS/PhD in a scientific field or equivalent experience\n• You want to work in a fast, high-growth startup environment that respects its engineers and customers\n\nBonus points:\n• You've worked at high scale with systems like Redis, Cassandra, Kafka\n• You wrote your own data pipelines once or twice before\n• You have a strong background in statistics\n• You have significant experience with Go, C, or Python\n\nIs this you? Let's chat!\n\n#LI-MF3\nThe reasonably estimated salary for this role at Datadog ranges from $130,000 - $300,000, plus a competitive equity package, and may include variable compensation. Actual compensation is based on factors such as the candidate's skills, qualifications, and experience. In addition, Datadog offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, a 401(k) plan and match, paid time off, fitness reimbursements, and a discounted employee stock purchase plan", 'job_highlights': [{'title': 'Qualifications', 'items': ['You have significant experience in one or more languages', 'You value code simplicity and performance', 'You can design architecture to solve problems at high scale', 'You have a BS/MS/PhD in a scientific field or equivalent experience', 'You want to work in a fast, high-growth startup environment that respects its engineers and customers', "You've worked at high scale with systems like Redis, Cassandra, Kafka", 'You wrote your own data pipelines once or twice before', 'You have a strong background in statistics', 'You have significant experience with Go, C, or Python']}, {'title': 'Responsibilities', 'items': ['Solve a scaling bottleneck in a critical service', 'Deploy a new feature to production, progressively rolling it out with feature flags', 'Investigate and fix a production issue from a service your team owns', 'Design a way to scale up a service for more traffic', 'With your team, plan the most important projects to work on next']}, {'title': 'Benefits', 'items': ['The reasonably estimated salary for this role at Datadog ranges from $130,000 - $300,000, plus a competitive equity package, and may include variable compensation', "Actual compensation is based on factors such as the candidate's skills, qualifications, and experience", 'In addition, Datadog offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, a 401(k) plan and match, paid time off, fitness reimbursements, and a discounted employee stock purchase plan']}], 'related_links': [{'link': 'https://www.datadog.com/', 'text': 'datadog.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Datadog&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCIkL', 'text': 'See web results for Datadog'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRECDGT9tps9bZzZlYMhhG2YUfOhW3ccCQRimkh&s=0', 'extensions': ['Full-time', 'Health insurance', 'Dental insurance', 'Paid time off'], 'detected_extensions': {'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiQkRiVmJBbVZxMXhFcWhVeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTUxVjJoamExRnFRVUoyVEhoV1ZGQkpaVkpqUkdseWNteDBPV0pHY0c5YVNUUlJTMWN6ZFdsU1MzTlpZV0UxWlVSWGVHcEhRazl0WlRrM1pGWnRlRGxOYkVNeE5HYzFWMjVhV0RRMFVIVjJSbkJMUXpsc1UzSldUMEUwYW5WWVJGRkRjbnBCTVZaeGQxRmxiV2w1ZDBWMFdUUlNUWGhmUzJSVVRYRm1iMVpVVkhOWU9VMVVUWEZ1VldoMFEwbDVkbXhwYkY5dWVHNW1WM1Y1Tnpkb2RXeEJSbmd0ZG5OUE1YRlRiSGRzU0Mxd1FUZEtZVkZzWHpnMlZqbGFWbWxzU1VObFRsbEVZVFUzTnpSb0VoZFBObDloV2xsWFpVVlFVM2sxVG05UWJtRXRkM05CV1JvaVFWQllhRzAxWW5kaWQydFRZV0U1UzA1d2FsWjRNRmQ1YzFodlowVllWSEZXWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIERhdGFkb2cgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuZGF0YWRvZ2hxLmNvbS9kZXRhaWwvMzg1MTkzNS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=='}, {'title': 'Senior Software Engineer - Apple Services Engineering, Commerce', 'company_name': 'Apple', 'location': '  New York, NY   ', 'via': 'via Careers At Apple', 'description': 'Summary\nPosted: Feb 19, 2024\nWeekly Hours: 40...\nRole Number:200535943\n\nThe Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, flexible, and multi-functional, offering greater exposure to the array of opportunities here.\n\nKey Qualifications\n\nKey Qualifications\n• At least 5+ years of Java programming experience.\n• Object-oriented programming\n• Hands-on software engineering experience, particularly with Java and Service Oriented Architectures\n• Excellent interpersonal skills\n• Curiosity\n• Willing to take ownership and set direction, especially in gray areas\n• The attitude that technical debt as an opportunity for better engineering\n• Strong sense of responsibility\n• Knowledge of databases both SQL and NoSQL and entity relationship modeling\n• Experience programming for eventual consistency\n• Experience working in a large code base\n• Experience/knowledge working on highly scalable applications and RESTful web services\n• Familiarity with scalability and performance issues\n• Excellent judgment and integrity with the ability to make timely and sound decisions\n• Interest in the commerce domain\n\nDescription\n\nDescription\nThe Apple Services Engineering Commerce team is looking for an outstanding individual to join our platform engineering team. The Commerce team provides the transactional engine for App Store, Apple Music, Apple Music, iBookStore, Mac App Store, Apple TV and more. Our platform is the highest volume digital content store in the world, serving billions of transactions daily in 129 countries. You’ll build services and application components, shared across applications, to support very high levels of transactional integrity, scalability, availability, fault tolerance, and security. You will also contribute to the architecture, design and implementation of top-level user visible features, with an emphasis on identifying components that can be reused across different scenarios and domains. The position requires someone comfortable with all aspects of the software design lifecycle and experienced with high performance distributed systems. We partner with a variety of cross and multi-functional team members from a diverse array of groups across the company. Do you thrive in a dynamic cross-functional environment and are you able to pivot with constantly evolving requirements and new technologies? Then you’ll love it here. You will work on features that touch all Apple Media Products Commerce services — from account management, application, music, and video purchase/download/entitlement, subscription management, and a lot of new features coming to the Apple product ecosystem. You will perform analysis, derive strategies, and write code to ensure that the stores financial transactions maintain key characteristics: ACID integrity, scalability, availability, fault tolerance, and security. You will identify opportunities for software reuse across problem domains, design and code components/libraries/frameworks to support that reuse, and refactor code to achieve higher levels of leverage in the codebase. Using 3rd party and hand-rolled solutions, you will build infrastructure for caching, messaging, and workflow management, that will be used by other teams in the Commerce group.\n\nEducation & Experience\n\nEducation & Experience\nBS in Computer Science or equivalent experience. MS preferred.\n\nAdditional Requirements\n\nAdditional Requirements\n\nPay & Benefits\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900.00 and $256,500.00, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics', 'job_highlights': [{'title': 'Qualifications', 'items': ['At least 5+ years of Java programming experience', 'Object-oriented programming', 'Hands-on software engineering experience, particularly with Java and Service Oriented Architectures', 'Excellent interpersonal skills', 'Curiosity', 'Willing to take ownership and set direction, especially in gray areas', 'The attitude that technical debt as an opportunity for better engineering', 'Strong sense of responsibility', 'Knowledge of databases both SQL and NoSQL and entity relationship modeling', 'Experience programming for eventual consistency', 'Experience working in a large code base', 'Experience/knowledge working on highly scalable applications and RESTful web services', 'Familiarity with scalability and performance issues', 'Excellent judgment and integrity with the ability to make timely and sound decisions', 'Interest in the commerce domain', 'The position requires someone comfortable with all aspects of the software design lifecycle and experienced with high performance distributed systems', 'BS in Computer Science or equivalent experience']}, {'title': 'Responsibilities', 'items': ['You’ll build services and application components, shared across applications, to support very high levels of transactional integrity, scalability, availability, fault tolerance, and security', 'You will also contribute to the architecture, design and implementation of top-level user visible features, with an emphasis on identifying components that can be reused across different scenarios and domains', 'You will work on features that touch all Apple Media Products Commerce services — from account management, application, music, and video purchase/download/entitlement, subscription management, and a lot of new features coming to the Apple product ecosystem', 'You will perform analysis, derive strategies, and write code to ensure that the stores financial transactions maintain key characteristics: ACID integrity, scalability, availability, fault tolerance, and security', 'You will identify opportunities for software reuse across problem domains, design and code components/libraries/frameworks to support that reuse, and refactor code to achieve higher levels of leverage in the codebase', 'Using 3rd party and hand-rolled solutions, you will build infrastructure for caching, messaging, and workflow management, that will be used by other teams in the Commerce group']}, {'title': 'Benefits', 'items': ['Pay & Benefits', 'At Apple, base pay is one part of our total compensation package and is determined within a range', 'The base pay range for this role is between $138,900.00 and $256,500.00, and your base pay will depend on your skills, qualifications, experience, and location', 'You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition', 'Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation']}], 'related_links': [{'link': 'http://www.apple.com/', 'text': 'apple.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Apple&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCOAL', 'text': 'See web results for Apple'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRrGv1mwjAAcRpCBNFJqhHUrLDBCojde7VFUsuc87k&s', 'extensions': ['6 days ago', 'Full-time', 'Health insurance', 'Dental insurance'], 'detected_extensions': {'posted_at': '6 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBBcHBsZSBTZXJ2aWNlcyBFbmdpbmVlcmluZywgQ29tbWVyY2UiLCJodGlkb2NpZCI6ImFpT29ESXJ1dUg4aFdEOGRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0laVG1WM0lGbHZjbXNzVGxrc1ZXNXBkR1ZrSUZOMFlYUmxjdyIsImhsIjoiZW4iLCJmYyI6IkVzd0NDb3dDUVU1MVYyaGpialIzVlc5Q05VMVJaVWhKVkdaS2FuaHNVWFl3YW1kalpFUlJZemxEZERSNldUQlBjVXhuZFU5TWQzWm9UblpDUkhSV1NqWlhaVWg2ZUhsV1pXVTBVazlOYzFRelh6TXRjWEpLZGtKS2RVVkpVWE5LUjNaSlZITmtVa2hvZEdWMFVISldaWGhqVldkT1lsSTBWRE42WVV3ek5URktlVGhpYTNCa1dGWTJkVmcxTFVnelRUbHJOakpJVGs5RVl6aDZTM0pIWVVkcFYzQXhWR1p6TWxaT1dYRnRRa3hFVUZKaU5UaEVibHB0VXpCYVdHczVVRmxXT1Zwd1VXSm1Va3BNUm1SMVVXNWhaVEJNUkRKS1pXNUxTM2RtWVRJd2JESTVWVWRrVUVkcVNGb3dORlJ2WDFKVGVVUnBZVkZsVVRGclFYcEVYMnQyTTNkd2FuYzJVbVkyVFdWTlpWWm9RaElYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5WbElVbnBXTjA0MlgyNVBlbXB1Y0RWNGJIaE5NbkJ3T0RGeVlXYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ2FyZWVycyBBdCBBcHBsZSIsImxpbmsiOiJodHRwczovL2pvYnMuYXBwbGUuY29tL2VuLXVzL2RldGFpbHMvMjAwNTM1OTQzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1hcHBsZS1zZXJ2aWNlcy1lbmdpbmVlcmluZy1jb21tZXJjZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}, {'title': 'Senior Software Engineer-1', 'company_name': 'Mastercard', 'location': '  New York, NY   ', 'via': 'via Careers At Mastercard', 'description': 'Job Title:\n\nSenior Software Engineer-1...\n\nOverview:\n\nOverview\n• Responsible for the analysis, design, development and delivery of software solutions\n• Defines requirements for new applications and customizations, adhering to standards, processes and best practices\n\nResponsibilities\n• Participate in team prioritization discussions with Product/Business stakeholders\n• Estimate and own delivery tasks (design, dev, test, deployment, configuration, documentation) to meet the business requirements\n• Automate build, operate, and run aspects of software\n• Drive code/design/process trade-off discussions within their team when required\n• Report status and manage risks within their primary application/service\n• Drive integration of services focusing on customer journey and experience\n• Perform demos/acceptance discussions in interacting with Product owners\n• Understands operational and engineering experience, actively works to improve experience and metrics in ownership area\n• Develop complete understanding of end-to-end technical architecture and dependency systems\n• Drive adoption of technology standards and opinionated frameworks, and review coding, test, and automation work of team members\n• Mentor and guide new and less-experienced team members\n• Identify opportunities to improve an overall process and trim waste\n• Share and seek knowledge within their Guild/Program to drive reuse of patterns/libraries/practices and enhance productivity\n\nExperiences\n• Has ability to write secure code in three or more languages (e.g., C, C+, C#, Java, JavaScript) and familiar with secure coding standards (e.g., OWASP, CWE, SEI CERT) and vulnerability management\n• Understands the basic engineering principles used in building and running mission critical software capabilities (security, customer experience, testing, operability, simplification, service-oriented architecture)\n• Understands internals of operating systems (Windows, Linux) to write interoperable and performant code\n• Able to perform debugging and troubleshooting to analyze core, heap, thread dumps and remove coding errors\n• Understands and implements standard branching (e.g., Gitflow) and peer review practices\n• Has skills in test driven and behavior driven development (TDD and BDD) to build just enough code and collaborate on the desired functionality\n• Understands use cases for advanced design patterns (e.g., service-to-worker, MVC, API gateway, intercepting filter, dependency injection, lazy loading, all from the gang of four) to implement efficient code\n• Understands and implements Application Programming Interface (API) standards and cataloging to drive API/service adoption and commercialization\n• Has skills to author test code with lots of smaller tests followed by few contract tests at service level and fewer journey tests at the integration level (Test Pyramid concept)\n• Apply tools (e.g., Sonar, Zally, Checkmarx ) and techniques to scan and measure code quality and anti-patterns as part of development activity\n• Has skills to collaborate with team and business stakeholders to estimate requirements (e.g., story pointing) and prioritize based on business value\n• Has skills to elaborate and estimate non-functional requirements, including security (e.g., data protection, authentication, authorization), regulatory, and performance (SLAs, throughput, transactions per second)\n• Has skills to orchestrate release workflows and pipelines, and apply standardized pipelines via APIs to achieve CI and CD using industry standard tools (e.g., Jenkins, AWS/Azure pipelines, XL Release, others).\n• Has skills to understand, report, and optimize delivery metrics to continuously improve upon them (e.g., velocity, throughput, lead time, defect leakage, burndown)\n• Has skills to document and drive definition-of-done for requirements to meet both business and operational needs\n• Understands how to build robust tests to minimize defect leakage by performing regression, performance, deployment verification, and release testing\n• Has skills to conduct product demos and co-ordinate with product owners to drive product acceptance signoffs\n• Has skills to Understands customer journeys and ensure a Mastercard good experience by continuously reducing Mean time to mitigate (MTTM) for incidents and ensuring high availability (99.95% as a starting point', 'job_highlights': [{'title': 'Qualifications', 'items': ['Has ability to write secure code in three or more languages (e.g., C, C+, C#, Java, JavaScript) and familiar with secure coding standards (e.g., OWASP, CWE, SEI CERT) and vulnerability management', 'Understands the basic engineering principles used in building and running mission critical software capabilities (security, customer experience, testing, operability, simplification, service-oriented architecture)', 'Understands internals of operating systems (Windows, Linux) to write interoperable and performant code', 'Understands use cases for advanced design patterns (e.g., service-to-worker, MVC, API gateway, intercepting filter, dependency injection, lazy loading, all from the gang of four) to implement efficient code', 'Has skills to author test code with lots of smaller tests followed by few contract tests at service level and fewer journey tests at the integration level (Test Pyramid concept)', 'Has skills to collaborate with team and business stakeholders to estimate requirements (e.g., story pointing) and prioritize based on business value', 'Has skills to elaborate and estimate non-functional requirements, including security (e.g., data protection, authentication, authorization), regulatory, and performance (SLAs, throughput, transactions per second)', 'Has skills to orchestrate release workflows and pipelines, and apply standardized pipelines via APIs to achieve CI and CD using industry standard tools (e.g., Jenkins, AWS/Azure pipelines, XL Release, others)', 'Has skills to understand, report, and optimize delivery metrics to continuously improve upon them (e.g., velocity, throughput, lead time, defect leakage, burndown)', 'Has skills to document and drive definition-of-done for requirements to meet both business and operational needs', 'Understands how to build robust tests to minimize defect leakage by performing regression, performance, deployment verification, and release testing', 'Has skills to conduct product demos and co-ordinate with product owners to drive product acceptance signoffs', 'Has skills to Understands customer journeys and ensure a Mastercard good experience by continuously reducing Mean time to mitigate (MTTM) for incidents and ensuring high availability (99.95% as a starting point)']}, {'title': 'Responsibilities', 'items': ['Responsible for the analysis, design, development and delivery of software solutions', 'Defines requirements for new applications and customizations, adhering to standards, processes and best practices', 'Participate in team prioritization discussions with Product/Business stakeholders', 'Estimate and own delivery tasks (design, dev, test, deployment, configuration, documentation) to meet the business requirements', 'Automate build, operate, and run aspects of software', 'Drive code/design/process trade-off discussions within their team when required', 'Report status and manage risks within their primary application/service', 'Drive integration of services focusing on customer journey and experience', 'Perform demos/acceptance discussions in interacting with Product owners', 'Understands operational and engineering experience, actively works to improve experience and metrics in ownership area', 'Develop complete understanding of end-to-end technical architecture and dependency systems', 'Drive adoption of technology standards and opinionated frameworks, and review coding, test, and automation work of team members', 'Mentor and guide new and less-experienced team members', 'Identify opportunities to improve an overall process and trim waste', 'Share and seek knowledge within their Guild/Program to drive reuse of patterns/libraries/practices and enhance productivity', 'Able to perform debugging and troubleshooting to analyze core, heap, thread dumps and remove coding errors']}], 'related_links': [{'link': 'http://www.mastercard.com/', 'text': 'mastercard.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Mastercard&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCLcM', 'text': 'See web results for Mastercard'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSL0UWF2LOMVhuhm6hUnR1Md8sefjI4CmWLrZqR90Q&s', 'extensions': ['5 days ago', 'Full-time', 'No degree mentioned'], 'detected_extensions': {'posted_at': '5 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXItMSIsImh0aWRvY2lkIjoiMUh5bHBfYXRQdjhqWU54QUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTUxVjJoamEzSTVRM0UzY2w5R01XZDBibGt6YmtSTWFFTnpUelZTVGtsRlQzZEVUM0ZNTTNOM1NsWjZiVUZDZVVkUFlYQmxTalF3WDJwZk56Y3hiVkUwVFRGbFpFODViVWwwUVUxaGFHNDBWbWw1VlhNNVJUQllXamRFUVdabVFVcE1kSFJhT0Rkek9IcGpSMmhsTjFGMk1uSldZa1ZqVjIxbVFuRkJRVGxLU2xWTFkzaFlkMlZDVFRaWWMwZFJhVVJFYkdwbFgwZzRUblJSTFVkWVpqRTBTR1ZxVFdab1dGaFdUMUZVU0U5NWREWjNia054WDNwRk4zaDBjWFJyVFdKc05tMTRlbXMyZDBkRldXeDZTaTA0WVVaMFIwMUZZMVpVYVRsb1IwVjRRUklYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5WbHdiVTB4U1dwRlpHRllTVVpLUm14SE4xWmZaMEp4V2tGQkxXYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ2FyZWVycyBBdCBNYXN0ZXJjYXJkIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5tYXN0ZXJjYXJkLmNvbS91cy9lbi9qb2IvUi0yMTQzNDgvU2VuaW9yLVNvZnR3YXJlLUVuZ2luZWVyLTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=='}, {'title': 'Software Engineer - Developer Experience', 'company_name': 'Datadog', 'location': '  New York, NY   ', 'via': 'via Datadog Careers', 'description': "The Dependency Management team is part of the Developer experience Org. Our team works on building features to automate the software lifecycle management for all of Datadog Engineering. We build features to improve the developer experience at Datadog and to ensure the software supply chain is secure and up to date. As a Software Engineer on the Dependency management team, you will work on... building a key part of our platform, own and improve systems running at high scale. You’ll join at an ideal time to make a big impact, the product is seeing very high growth, adaptability and investment from leadership on our roadmap with many new features to build.\n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\nWhat You’ll Do:\n• Design, Implement, Own and support one of our key components end to end.\n• Write a significant amount of code, lead architectural decisions for new and existing services\n• Run a lightweight agile process to pace and track what we work on and deliver high quality work\n\nWho You Are:\n• Self motivated, self starter builder who takes pride in solving problems for your customers and are able to identify customer needs and pain points proactively.\n• A proven ability to own and deliver features in a fast-paced, high-growth startup environment to build a brand new product.\n• 4+ years of experience working on backend engineering preferably using one of Java / Python / Go language but language skill is not a blocker.\n• Experience with working on developer tooling / developer experience projects.\n\nBonus points for:\n• Experience with Go-Lang\n• Experience with artifactory, testing frameworks, & Package Managers like Pip, Npm, Cargo etc\n• Experience with Github APIs\n• Experience with Vulnerability management\n• Experience with Software Inventory Management\n\nDatadog values people from all walks of life. We know not everyone will meet all the above qualifications on day one. That’s okay. If you’re passionate about technology and want to grow your experience, we encourage you to apply.\n\nBenefits & Growth:\n• New hire stock equity (RSUs) and employee stock purchase plan (ESPP)\n• Continuous professional development, product training, and career pathing\n• Intradepartmental mentor and buddy program for in-house networking\n• An inclusive company culture, ability to join our Community Guilds (Datadog employee resource groups)\n• Access to Inclusion Talks, our internal panel discussions\n• Free, global mental health benefits for employees and dependents age 6+\n• Competitive global benefits\n\nBenefits and Growth listed above may vary based on the country of your employment and the nature of your employment with Datadog.\n\nThe reasonably estimated salary for this role at Datadog ranges from $130,000 to $300,000, plus a competitive equity package, and may include variable compensation. Actual compensation is based on factors such as the candidate's skills, qualifications, and experience. In addition, Datadog offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, a 401(k) plan and match, paid time off, fitness reimbursements, and a discounted employee stock purchase plan.\n\n#LI-BP1", 'job_highlights': [{'title': 'Qualifications', 'items': ['Self motivated, self starter builder who takes pride in solving problems for your customers and are able to identify customer needs and pain points proactively', 'A proven ability to own and deliver features in a fast-paced, high-growth startup environment to build a brand new product', '4+ years of experience working on backend engineering preferably using one of Java / Python / Go language but language skill is not a blocker', 'Experience with working on developer tooling / developer experience projects', 'Experience with Go-Lang', 'Experience with artifactory, testing frameworks, & Package Managers like Pip, Npm, Cargo etc', 'Experience with Github APIs', 'Experience with Vulnerability management', 'Experience with Software Inventory Management', 'Datadog values people from all walks of life']}, {'title': 'Responsibilities', 'items': ['As a Software Engineer on the Dependency management team, you will work on building a key part of our platform, own and improve systems running at high scale', 'Design, Implement, Own and support one of our key components end to end', 'Write a significant amount of code, lead architectural decisions for new and existing services', 'Run a lightweight agile process to pace and track what we work on and deliver high quality work']}, {'title': 'Benefits', 'items': ['New hire stock equity (RSUs) and employee stock purchase plan (ESPP)', 'Continuous professional development, product training, and career pathing', 'Intradepartmental mentor and buddy program for in-house networking', 'Access to Inclusion Talks, our internal panel discussions', 'Free, global mental health benefits for employees and dependents age 6+', 'Competitive global benefits', 'Benefits and Growth listed above may vary based on the country of your employment and the nature of your employment with Datadog', 'The reasonably estimated salary for this role at Datadog ranges from $130,000 to $300,000, plus a competitive equity package, and may include variable compensation', "Actual compensation is based on factors such as the candidate's skills, qualifications, and experience", 'In addition, Datadog offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, a 401(k) plan and match, paid time off, fitness reimbursements, and a discounted employee stock purchase plan']}], 'related_links': [{'link': 'https://www.datadog.com/', 'text': 'datadog.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Datadog&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCIgN', 'text': 'See web results for Datadog'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRECDGT9tps9bZzZlYMhhG2YUfOhW3ccCQRimkh&s=0', 'extensions': ['3 days ago', 'Full-time', 'No degree mentioned', 'Health insurance', 'Dental insurance', 'Paid time off'], 'detected_extensions': {'posted_at': '3 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIERldmVsb3BlciBFeHBlcmllbmNlIiwiaHRpZG9jaWQiOiJnY3Y0Yi1ieE84bVZGdnF2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJWlRtVjNJRmx2Y21zc1Rsa3NWVzVwZEdWa0lGTjBZWFJsY3ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNTFWMmhqYm05TFpIbHBNWFJHZFZVeU1GbzBiMGxDZWpBNWEzUXdNMnBFZVhSUGQybFdXbEJxYWtoRWEycGFNMjh6Ukhabk4zaGFORWh0ZG1vemNqUjJha3hOUTNkWFQwWjFXRTl4Y2xOR2RWWlpVbkl0VTIxVE9GUmtkM2xrYkRsdlYyMWhPVGRPWlcxdVZFdFZWVEZrV1ZCYU9XZDZSV3BUUVhJdGNWTk5lRVIwVmt0U1JUVk5VRkJoTVZWNU9YSTJSa0ZsWDNac2FIaFVVSGxHTWs1RFpGQmpSRGhCZDE5Q1NGbFdhamhIZEhvM1NsY3dMVVJXUVhCNFdGcDRVUzFLWm1aMlYxUXhjMVUzUVVaUFQyOTZRbFpwZUdsbmNUZFVVbVpCU1ZoRFNVdHROSFZQVDNwbVltNXRaRGxsTkc5S04xZHFVUklYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5XRlZUSEpXY1ZKSFIzaFdOVEl3U1VVd2NEbFNaRVF5UWtGSVFYYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIERhdGFkb2cgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuZGF0YWRvZ2hxLmNvbS9kZXRhaWwvNTc0NDY1Ni8/Z2hfamlkPTU3NDQ2NTZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}, {'title': 'Software Engineer', 'company_name': 'Angi', 'location': '  New York, NY   ', 'via': 'via Greenhouse', 'description': "The Opportunity:\n\nWe are looking for a Software Developer with 4+ years of experience to join our growing team! In this role, you'll take on the rewarding challenge of not just writing clean, efficient code, but also nurturing it through testing, documentation, and clear communication. It's a chance to truly own your work and contribute to a team where learning and growth are part of the daily... routine, all within a supportive environment that values collaboration and personal development. Our software is currently written with Java, Ruby, Scala and JavaScript. This position can be hybrid in NYC, Denver, or Indianapolis, or fully remote.\n\nAs a Software Engineer:\n• You will foster a collaborative environment for you and your teammates to deliver high-quality, reliable, and well-tested features to ensure our customers and professionals enjoy the best possible experience with our product.\n• Collaborating with professionals across the organization to gain a shared understanding of the initiative, you will analyze requirements and propose solutions that meet product and business needs while balancing time and cost.\n• You'll write, modify and review clean, maintainable code and implement features to enhance our application's performance and scalability. You'll engage actively in code sprints and agile processes, contributing to all development lifecycle phases. As you go, you'll create or modify a suite of tests to exercise the initiative’s functionality in an automated manner.\n• You're an owner - you're responsible for operating what you and your teammates built in production. You'll ensure that the code meets performance, reliability, quality, security, and testability standards.\n• Your voice matters - you'll actively participate and lead discussions in team and project meetings to ensure we're solving the right problems, designing systems in a scalable way, and delivering products that help customers love where they live & pros build their businesses.\n\nWho you are:\n• You have at least 4 years of hands-on development experience, ideally in a tech or marketplace environment\n• You have a BS or MS in Computer Science or related STEM field\n• You have experience in developing enterprise-level features with an emphasis on functional programming, ideally in Java, Scala, or Ruby on Rails\n• You understand how to use code versioning tools, such as Git\n• You're an exceptional communicator & can work with and effectively collaborate across multiple technical and non-technical teams\n\nPreferred:\n• Familiarity with microservices and creating RESTful APIs\n• Understanding of React.js and Redux and their core principles\n• Experience with ElasticSearch and Kafka\n• Experience working with application monitoring tools such as New Relic\n• Experienced with application monitoring strategies and Tools (New Relic, etc)\n• Experience with containerization tools (Docker, Kubernetes)\n• Experience working with less experienced engineers, providing them with coaching and mentorship to help them become better engineers\n• Willingness to learn and apply new skills and technologies\n\nCompensation & Benefits:\n• The salary band for this position ranges from $110,000-175,000, commensurate with experience and performance.\n• Full medical, dental, vision package and a retirement plan to fit your needs\n• Flexible vacation policy; work hard and take time when you need it\n• The rare opportunity to work with sharp, motivated teammates solving some of the most unique challenges and changing the world\n\n#LI-Remote", 'job_highlights': [{'title': 'Qualifications', 'items': ['We are looking for a Software Developer with 4+ years of experience to join our growing team!', 'You have at least 4 years of hands-on development experience, ideally in a tech or marketplace environment', 'You have a BS or MS in Computer Science or related STEM field', 'You have experience in developing enterprise-level features with an emphasis on functional programming, ideally in Java, Scala, or Ruby on Rails', 'You understand how to use code versioning tools, such as Git', "You're an exceptional communicator & can work with and effectively collaborate across multiple technical and non-technical teams"]}, {'title': 'Responsibilities', 'items': ["In this role, you'll take on the rewarding challenge of not just writing clean, efficient code, but also nurturing it through testing, documentation, and clear communication", 'You will foster a collaborative environment for you and your teammates to deliver high-quality, reliable, and well-tested features to ensure our customers and professionals enjoy the best possible experience with our product', 'Collaborating with professionals across the organization to gain a shared understanding of the initiative, you will analyze requirements and propose solutions that meet product and business needs while balancing time and cost', "You'll write, modify and review clean, maintainable code and implement features to enhance our application's performance and scalability", "You'll engage actively in code sprints and agile processes, contributing to all development lifecycle phases", "As you go, you'll create or modify a suite of tests to exercise the initiative’s functionality in an automated manner", "You're an owner - you're responsible for operating what you and your teammates built in production", "You'll ensure that the code meets performance, reliability, quality, security, and testability standards", "Your voice matters - you'll actively participate and lead discussions in team and project meetings to ensure we're solving the right problems, designing systems in a scalable way, and delivering products that help customers love where they live & pros build their businesses"]}, {'title': 'Benefits', 'items': ['The salary band for this position ranges from $110,000-175,000, commensurate with experience and performance', 'Full medical, dental, vision package and a retirement plan to fit your needs', 'Flexible vacation policy; work hard and take time when you need it', 'The rare opportunity to work with sharp, motivated teammates solving some of the most unique challenges and changing the world']}], 'related_links': [{'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Angi&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCNsN', 'text': 'See web results for Angi'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSOCDcUHexUe400pya8WzXWyA8K3v4IXIcKHdNrH1c&s', 'extensions': ['17 days ago', 'Full-time', 'Health insurance', 'Dental insurance', 'Paid time off'], 'detected_extensions': {'posted_at': '17 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiRXhhYlFoSHlnaTZWaUlDZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTUxVjJoamJrUmxWVXh1UXpaS2EwTnFOVTUzT0hKeWFVUXdaMmhSWVV4eVYyeFdTWEl3Y1VSc2VIVnVMVGxVUzBSeVF6UnBRVXRzYkZOa2JHWmhNRGczWjNWeVRHZHNTVGhOWjNBNU1DMWxUbVpZV1ZvellWSmlaMUJKYzNac1pIcGthWFZGWDBOTFduWmZkMUE1TjJvMk1tNWpkVVZQVGpsMVNFRnJMWGxPTWpGZllXZDBablV0UVZaR1drZENNRFpEVVZwZlRFMXZjMmN0ZW5oR2NHOXhWVnBsV0ZSNE1sOXVjVkJ5VFVKdVpWa3pjelpFZFZGNWEyOVFNbXg2VGxwWlJWcDFTRkZwVkVaSUVoZFBObDloV2xsWFpVVlFVM2sxVG05UWJtRXRkM05CV1JvaVFWQllhRzAxWWxReFUwSnlkQzFOWTBsVGJWZFRkVUZRUWtjeVgyNVBiemxqZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHcmVlbmhvdXNlIiwibGluayI6Imh0dHBzOi8vYm9hcmRzLmdyZWVuaG91c2UuaW8vYW5naS9qb2JzLzcxMDc4MTAwMDI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=='}, {'title': 'Senior Full Stack Software Engineer', 'company_name': 'Intuit', 'location': '  New York, NY   ', 'via': 'via Intuit Careers', 'description': "Intuit is the global leader in financial management software where we have pioneered the shift to Virtual Platforms, cloud computing for consumers, small businesses and those that serve them. Intuit acts as a 40 year old startup, and we are constantly disrupting ourselves as we identify major new technology and design trends that are needed to deliver our mission to power prosperity around the... world. Our groups are fast-paced teams focused on delivering innovative capabilities, and having fun while doing it.\n\nNote: By applying to this position, your application will be automatically submitted for the following location: New York.\nResponsibilities\n• Write scalable application code following best practices of accessibility, internationalization and instrumentation\n• Hands-on development. Write highest quality code with utmost attention to scalability and performance\n• Builds effective internal and external relationships that are essential to delivering a quality software product or service\n• Stay aware of industry trends and make technology choices and strategic decisions\n• Subject matter expert on technologies\n• Ability to take a vague customer problem and solve it end to end with accountability\n\nTeam/Leadership Characteristics:\n• Team player possessing strong analytical, problem solving and communication skills\n• Strong mentoring skills with ability to provide technical guidance and review code\n• Ability to work with global teams across time zones\n• Ability to work effectively in a fast paced, complex technical environment with high adaptability and flexibility\n• Experience working with cross-functional teams while maintaining effective working relationships\n• Communicates clearly, succinctly and persuasively to all levels of employees, customers and management\n• 'Self-starter' attitude and the ability to make decisions independently", 'job_highlights': [{'title': 'Qualifications', 'items': ['Subject matter expert on technologies', 'Ability to take a vague customer problem and solve it end to end with accountability', 'Team player possessing strong analytical, problem solving and communication skills', 'Strong mentoring skills with ability to provide technical guidance and review code', 'Ability to work with global teams across time zones', 'Ability to work effectively in a fast paced, complex technical environment with high adaptability and flexibility', 'Experience working with cross-functional teams while maintaining effective working relationships', 'Communicates clearly, succinctly and persuasively to all levels of employees, customers and management', "'Self-starter' attitude and the ability to make decisions independently"]}, {'title': 'Responsibilities', 'items': ['Write scalable application code following best practices of accessibility, internationalization and instrumentation', 'Hands-on development', 'Write highest quality code with utmost attention to scalability and performance', 'Builds effective internal and external relationships that are essential to delivering a quality software product or service', 'Stay aware of industry trends and make technology choices and strategic decisions']}], 'related_links': [{'link': 'http://www.intuit.com/', 'text': 'intuit.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Intuit&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCLEO', 'text': 'See web results for Intuit'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwA8ld66oL3G5jItgJwBVoPpe9a8-fYR3jnXUPRZM&s', 'extensions': ['6 days ago', 'Full-time', 'No degree mentioned'], 'detected_extensions': {'posted_at': '6 days ago', 'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnVsbCBTdGFjayBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoicXg0bXNXcHhmNWZMaW5ybEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTUxVjJoamJUQkNSalU1Tm1sS05qbFhabEppWjJSb1dUbEpaMmxvV1RoUWJXOU5iV0Z5VkROQlVtNTFVM0pLU0VsMlZHSkpSMnhXU2xwNU0wOUZVbkpZWW1SemRUZG9hekJ3VkRCclRGSm5YMVpMU3pRd1RrNHlhR2MyVHpCd1Z6UmxjRlprY0VGUFlWSmFPRU55UVVoeVIxQjVNR1JxZVVsRVRVVnVNVUk0TWt4c09EQlJRakZQWVRKb1Qwc3liWFZCUVhvMWMzRmxjM0JrV1VselVVTTJOMWRHV1UxUmQxODNSMHBpUmpSTFFqbHBVV1o1TjBWVmEyZExWVTR5YldablkzbE9MVTlLU1VsWExUZFplWGxaVG1aUWJYZFVORkJ5YmtKalVXcFRaeElYVHpaZllWcFpWMlZGVUZONU5VNXZVRzVoTFhkelFWa2FJa0ZRV0dodE5WcFBXVTFCWnpoc2NrVnFWR3BQVEd4clgxWlNPSE5ZTkV0WlkwRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEludHVpdCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vam9icy5pbnR1aXQuY29tL2pvYi9uZXcteW9yay9zZW5pb3ItZnVsbC1zdGFjay1zb2Z0d2FyZS1lbmdpbmVlci8yNzU5NS82MTU0NjgwMzg4OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}, {'title': 'Software Engineer, 340B', 'company_name': 'Berkeley Research Group', 'location': '  New York, NY   ', 'via': 'via Berkeley Research Group Careers', 'description': "Description\n\nBRGʼs 340B team is one of the Healthcare Analytics practice's largest and fastest-growing groups! The 340B team supports and advises pharmaceutical manufacturers on navigating the challenges and complexities of the 340B program, a government drug purchasing program. Our group is the established market leader in data and technology solutions related to the most pressing 340B-related... issues for an impressive client base, including the largest pharmaceutical manufacturers in the US. Beyond our syndicated solutions, we also integrate and synthesize data to deliver unparalleled analytics and insights into various aspects of the 340B program.\n\nOur 340B group is currently looking to expand our talented and dynamic product and development team. We are currently seeking front-end and full-stack Software Engineers and Senior Software Engineers who are passionate about solving challenging problems! Our software engineers take part in creating some of the most innovative software solutions in the dynamic and fascinating field of healthcare analytics. The 340B program is an exciting and vibrant space to be in right now, so come join us!\n\nJob title and compensation to be determined based on qualifications and experience. \n\nResponsibilities:\n• With your technical expertise you will manage project priorities, deadlines, and deliverables.\n• You will design, develop, test, deploy, maintain, and enhance software solutions.\n• Write product or system development code.\n• Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\n• Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\n• Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\n• Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n• Work in an environment that supports your individual growth.\n• Collaborate closely with other engineers and become a valued member of an autonomous, impactful, cross-functional team.\n\nTechnical Skill Set:\n• 5+ years of software development experience in one or more of the following programming languages: React, TypeScript, JavaScript, Ruby, Ruby on Rails, and/or Go/Golang.\n• Experience with Agile SDLC methodology, Jira, GitHub, Git (git-flow, merge, rebase, squashing, branch management) and working in a CI/CD environment.\n• Experience with one or more of the following: Kubernetes, MongoDB, Docker, and/or Microsoft Azure is a plus.\n\nRequirements:\n• 5+ years of solid software development experience; A minimum of 8-10+ years is required for the Senior level position. Job title to be determined based on relevant qualifications and experience. \n• Bachelor’s degree in Computer Science, Information Technology or a related field.\n• Strong problem-solving and analytical skills, with the ability to make quick decisions in a fast-paced environment with complete ownership.\n• Experience with code quality, continuous delivery, and automated testing.\n• Comfortable working in an agile environment and challenging yourself and your team to improve their ways of working.\n• Experience building scalable, user-friendly web applications.\n\nSalary Range: $100,000 - $230,000 per year\n\nCandidate must be able to submit verification of their legal right to work in the U.S., without company sponsorship.\n\n#LI-JQ1 | #LI-REMOTE", 'job_highlights': [{'title': 'Qualifications', 'items': ['5+ years of software development experience in one or more of the following programming languages: React, TypeScript, JavaScript, Ruby, Ruby on Rails, and/or Go/Golang', 'Experience with Agile SDLC methodology, Jira, GitHub, Git (git-flow, merge, rebase, squashing, branch management) and working in a CI/CD environment', '5+ years of solid software development experience; A minimum of 8-10+ years is required for the Senior level position', 'Job title to be determined based on relevant qualifications and experience.', 'Bachelor’s degree in Computer Science, Information Technology or a related field', 'Strong problem-solving and analytical skills, with the ability to make quick decisions in a fast-paced environment with complete ownership', 'Experience with code quality, continuous delivery, and automated testing', 'Comfortable working in an agile environment and challenging yourself and your team to improve their ways of working', 'Experience building scalable, user-friendly web applications', 'Candidate must be able to submit verification of their legal right to work in the U.S., without company sponsorship']}, {'title': 'Responsibilities', 'items': ['With your technical expertise you will manage project priorities, deadlines, and deliverables', 'You will design, develop, test, deploy, maintain, and enhance software solutions', 'Write product or system development code', 'Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies', 'Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency)', 'Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback', 'Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality', 'Work in an environment that supports your individual growth', 'Collaborate closely with other engineers and become a valued member of an autonomous, impactful, cross-functional team']}, {'title': 'Benefits', 'items': ['Salary Range: $100,000 - $230,000 per year']}], 'related_links': [{'link': 'http://www.thinkbrg.com/', 'text': 'thinkbrg.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Berkeley+Research+Group&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCIEP', 'text': 'See web results for Berkeley Research Group'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSzW8SGjpGP6OMJlZW6J9oQxroNSo17bZiQZlnm&s=0', 'extensions': ['Full-time'], 'detected_extensions': {'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgMzQwQiIsImh0aWRvY2lkIjoiczBmV1N6cnlneHBKZk4zOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSVpUbVYzSUZsdmNtc3NUbGtzVlc1cGRHVmtJRk4wWVhSbGN3IiwiaGwiOiJlbiIsImZjIjoiRXJjQ0N2Y0JRVTUxVjJoamJFc3hWMVp5VlRFM1dWOWxjVGRETTBkclgzTnhXWHBLTlZoVFYyRnBhREZSTjJoM2QzWnRXRGhYY21GUmMzUldlR1l0TTFaNlExZGFZVzFKY2s1V1pEVlRXRmcyY2pSUFFtWnJRVko1ZGpCa01VazFOM1UzTUZsU05sRklWRk5wVjNobGJuSjBTVkpLY0ZCaGFHMUhUbTFSZGxkcVFXdzFNRXgzV0ZsVlJVb3hXREJ1WTBwRE16WnJXazEwU0RNMWRVODNkM05IWkZkQ2RuaGZMVFJGZWpSUFdHaHFPV0k1UkdNd2QzbFlVamQxY1hKRWR6VkJiQzFsZWsxNFRGWjVTRmh1VFVjNFpraEJOMm90UkRoMVRWQk9VWGQ2TlZwM1ZXaGlSRXRTYjJKbk1tTnNVelJOV2pkNFFXbFFUak5MT0JJWFR6WmZZVnBaVjJWRlVGTjVOVTV2VUc1aExYZHpRVmthSWtGUVdHaHROV0ZZYTNGTlRUaEpjRzkxU1U5elozSXdjRVJDYzFGSGVtUTFUSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZXJrZWxleSBSZXNlYXJjaCBHcm91cCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy50aGlua2JyZy5jb20vam9icy8xMzI3ODY1Mi1zb2Z0d2FyZS1lbmdpbmVlci0zNDBiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0='}, {'title': 'Senior Software Engineer, Backend', 'company_name': 'Duolingo', 'location': '  New York, NY   ', 'via': 'via Greenhouse', 'description': "Our mission at Duolingo is to develop the best education in the world and make it universally available. But we’ve got more left to do — and that’s where you come in!\n\nDuolingo is the most popular language-learning application in the world, with over 500 million users and over half a billion exercises completed daily. Beyond our core learning product, we also offer English proficiency testing... with the Duolingo English Test, and are bringing new subjects into the Duolingo app, where people can develop their Math and Music skills.\n\nWe are passionate about educating our users, making fact-based decisions, and finding innovative solutions to complex problems. We offer meaningful work, limitless learning opportunities, and collaboration with world-class minds. Come brighten your life and over half a billion more!\n\nAs a Backend Engineer you will work on building the APIs that power our products and give our learners a best-in-class experience.\n\nOur microservices infrastructure is composed of hundreds of endpoints serving hundreds of millions of requests per day. You will partner with your team members on identifying requirements and designing services that are fast, resilient and cost effective. You will have ownership over the entire lifecycle of your services and associated infrastructure, and ensure they are always operating well.\n\nLearn more about our teams:\n\nMonetization Area:\n• The Monetization Area focuses on Duolingo’s key business drivers—subscriptions, ads, and in-app purchases. Our area’s goal is to build the best premium experiences for our learners while ensuring the sustainability and success of our business model. You will play an instrumental role in the strategic direction of Duolingo by developing and refining the methods that make our monetization efforts more effective and efficient.\n\nDuolingo English Test - Monetization & Acquisition Team\n• The Monetization & Acquisition team is responsible for growing the Duolingo English Test’s business and creating a delightful user experience before and after the test. As a senior engineer on the team, you will play a key role in shaping how we achieve this both technically and strategically. We’re looking for a product-minded engineer excited to make an impact!\n\nResponsibilities\n• Collaborate on software projects with product design and backend aspects\n• Develop, release, and maintain backend services and/or infrastructure\n• Lead individual project priorities, milestones, and ensure we're always shipping\n\nRequirements\n• A Bachelor’s degree in Computer Science or related technical field\n• Strong competencies in data structures, algorithms, and software design\n• Experience programming in Java, Python or Kotlin\n• Solid understanding of one or more database technologies\n\nExceptional candidates will have\n• Industry experience building high-traffic APIs using public cloud providers\n\nWe invest in and support our Duos! This role is eligible for a robust compensation package of base salary, equity, and Duolingo’s world-class benefits. The starting base salary range for this role is, $148,800 - $274,600. Actual salary may vary based on level, work experience, performance, and other factors evaluated during the hiring process.\n\nWe will do everything we can within reason to make sure that your interview takes place in an environment that fairly and accurately assesses your skills. If you need assistance or accommodation, please contact your recruiter.\n\nTake a peek at how we care for our employees' holistic well-being with our benefits here.\n\nDuolingo is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\nBy applying for this position your data will be processed as per the Duolingo Applicant Privacy Notice", 'job_highlights': [{'title': 'Qualifications', 'items': ['A Bachelor’s degree in Computer Science or related technical field', 'Strong competencies in data structures, algorithms, and software design', 'Experience programming in Java, Python or Kotlin', 'Solid understanding of one or more database technologies', 'Industry experience building high-traffic APIs using public cloud providers']}, {'title': 'Responsibilities', 'items': ['You will partner with your team members on identifying requirements and designing services that are fast, resilient and cost effective', 'You will have ownership over the entire lifecycle of your services and associated infrastructure, and ensure they are always operating well', 'You will play an instrumental role in the strategic direction of Duolingo by developing and refining the methods that make our monetization efforts more effective and efficient', 'Collaborate on software projects with product design and backend aspects', 'Develop, release, and maintain backend services and/or infrastructure', "Lead individual project priorities, milestones, and ensure we're always shipping"]}, {'title': 'Benefits', 'items': ['This role is eligible for a robust compensation package of base salary, equity, and Duolingo’s world-class benefits', 'The starting base salary range for this role is, $148,800 - $274,600']}], 'related_links': [{'link': 'http://www.duolingo.com/', 'text': 'duolingo.com'}, {'link': 'https://www.google.com/search?sca_esv=984acc50bffcff5a&hl=en&q=Duolingo&sa=X&ved=0ahUKEwjFp8jiwcWEAxV0GVkFHZ0XDGYQmJACCNAP', 'text': 'See web results for Duolingo'}], 'thumbnail': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZunqq0YGxQiSpGXiaRgfAeZt4jY7vDptA0yFmQb94eUNUljdXbsAx&s', 'extensions': ['Full-time', 'Health insurance'], 'detected_extensions': {'schedule_type': 'Full-time'}, 'job_id': 'eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIEJhY2tlbmQiLCJodGlkb2NpZCI6InpwMm5mcjdUX0xlSkpJTlRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0laVG1WM0lGbHZjbXNzVGxrc1ZXNXBkR1ZrSUZOMFlYUmxjdyIsImhsIjoiZW4iLCJmYyI6IkVyY0NDdmNCUVU1MVYyaGphMUZKT1dOMVJVWXpRblJoY1VrMlpuZzNhVlJEUjNOUGMxQmpNRGxSVkZWemVEVlBTeTA1ZURsWWJFbDJORFZ2UVRGaGJGSnhWakZzU1ZVemFFcGxOelZOY1doUWJYWlpTRXBTYXpOT1ZXVktPVzFNZVhCdE1ESnNiSFpDTVZSWGJsbDRWMmxOZFcxUVkycFVjMGhTT0UxNWEwTlhUV1Z2Y2xKcFREZFpOV2RHUm5NMlRrYzJVblJPTkZNM2IxRTVZbVI1YUZsVmEwNWhSR2MyWm5aWVJVdDFhbkE1V0ZCdExYcFFWV1o2TUZCblRsaHlXakJMWkRkSmJHNW5RWGRCVFRGYU5IRllSblZCVmxwdlJFZEJNbnBGVVRVMVptY3lOM2M0U0UxTk9GcFhSMlJHU1VOQ2JuUkVTMnRGYURaWFl4SVhUelpmWVZwWlYyVkZVRk41TlU1dlVHNWhMWGR6UVZrYUlrRlFXR2h0TldGMFN6aDVYM2RCTFZGdU5UUnRTSGh2WWt0dmFGVmZiM1J2TjJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlZW5ob3VzZSIsImxpbmsiOiJodHRwczovL2JvYXJkcy5ncmVlbmhvdXNlLmlvL2R1b2xpbmdvL2pvYnMvNzEwODYyNjAwMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19'}], 'chips': [{'type': 'Title', 'param': 'job_family_1', 'options': [{'text': 'All'}, {'text': 'Software engineer', 'value': 'software engineer'}, {'text': 'Software engineering', 'value': 'software engineering'}, {'text': 'Senior', 'value': 'senior'}, {'text': 'Engineer', 'value': 'engineer'}, {'text': 'Manager', 'value': 'manager'}, {'text': 'Principal', 'value': 'principal'}, {'text': 'Development engineer', 'value': 'development engineer'}, {'text': 'Graduate', 'value': 'graduate'}, {'text': 'Security engineer', 'value': 'security engineer'}, {'text': 'Senior director', 'value': 'senior director'}, {'text': 'Senior engineer', 'value': 'senior engineer'}, {'text': 'Software engineers', 'value': 'software engineers'}, {'text': 'Specialist', 'value': 'specialist'}, {'text': 'Sw engineer', 'value': 'sw engineer'}, {'text': 'Systems', 'value': 'systems'}, {'text': 'Technical', 'value': 'technical'}]}, {'type': 'Location', 'param': 'city', 'options': [{'text': 'All'}, {'text': 'New York, NY', 'value': 'Owg_06VPwoli_nfhBo8LyA=='}, {'text': 'Boston, MA', 'value': 'GzE9DS1l44mg6GIBJL98eA=='}, {'text': 'Annapolis Junction, MD', 'value': 'zW-xYyLnt4mqAms5YL-SKQ=='}, {'text': 'Herndon, VA', 'value': 'Q6ZdDwY4tol9NWwctSKAkg=='}, {'text': 'Reston, VA', 'value': '5WUWJkdAtomfrnGo6K_fYw=='}, {'text': 'Hanover, MD', 'value': 'CR8SmSTit4kd1ecDfu3Bcw=='}, {'text': 'Philadelphia, PA', 'value': '60u11Ni3xonBWD6M2BT1iQ=='}, {'text': 'Fort Meade, MD', 'value': 'jdor14Tmt4l3A9bF4c3sbg=='}, {'text': 'Jersey City, NJ', 'value': '3a-_JdJQwonZJc2iE_BJAg=='}, {'text': 'Baltimore, MD', 'value': 't4P01q4DyIlY5yNCqJZIBA=='}, {'text': 'Cambridge, MA', 'value': 'X8wwy6Vw44mHbGiJZI46xQ=='}, {'text': 'McLean, VA', 'value': 'O3mKsew1tonx6vqtXrpijg=='}, {'text': 'Arlington, VA', 'value': 'D6ene522t4mTsPZFyG_P-A=='}, {'text': 'Dale City, VA', 'value': 'CbidNcVXtonL-lFgPS89hg=='}, {'text': 'Framingham, MA', 'value': '33ddcTiI44liYxUiy2igng=='}, {'text': 'Gaithersburg, MD', 'value': 'tRPKJDYttok1cq2AgVqP4w=='}, {'text': 'Hartford, CT', 'value': 'pVER8hFT5omZWX3pqEqOzA=='}, {'text': 'Linthicum Heights, MD', 'value': 'J9uwpJjit4ngAaPYxcmQdQ=='}, {'text': 'Merrimack, NH', 'value': '1efXpFe044l54yBVgEdgtw=='}, {'text': 'Newark, NJ', 'value': 'HQ6aMnBTwolz5P7cKty84Q=='}, {'text': 'Washington, DC', 'value': 'W-T2Wt7Gt4kqXYjUIkVSwg=='}, {'text': 'Wilmington, DE', 'value': 'b69GXBgPx4kAjDB3UNoWhQ=='}, {'text': 'Alexandria, VA', 'value': '8aukkz5NtoksAcHbhib11w=='}, {'text': 'Annapolis, MD', 'value': '1S9ncGX2t4lLJ6jT_VT4Qw=='}, {'text': 'Centreville, VA', 'value': '855KeoFEtoks2skWESuTCQ=='}, {'text': 'Fairfax, VA', 'value': 'zZFLOZZOtolAhkSF5yYjBw=='}, {'text': 'Hoboken, NJ', 'value': '0TMVjWBXwomHvzcRasq2RA=='}, {'text': 'Holmdel, NJ', 'value': 'RRhIB_gywoleoeuQBVROvA=='}, {'text': 'Mount Vernon, NY', 'value': 'dYAB1EeNwomPDHe_vm417g=='}, {'text': 'Nashua, NH', 'value': 'hb_6LeSw44lV6otCEQhmtg=='}, {'text': 'North Reading, MA', 'value': 'z0OHihwM44lMKI-OAz053A=='}, {'text': 'Silver Spring, MD', 'value': 'J-lqZk7Pt4nfmrJlqDOEAA=='}, {'text': 'Troy, NY', 'value': 'c4cQTKcP3ok8cqT1-X4RMw=='}, {'text': 'Tysons, VA', 'value': '-Vv4YvBKton6332u8QVIfA=='}, {'text': 'Waltham, MA', 'value': '3eQad-F344nEWv4aYofa3g=='}, {'text': 'Aberdeen Proving Ground, MD', 'value': 'KbNtG83Bx4k4Bv9eIdQTUA=='}, {'text': 'Albany, NY', 'value': 'S_tPzDQK3onEKOegEmOh4Q=='}, {'text': 'Bala Cynwyd, PA', 'value': '7e-ZaKK4xols4Jb3ae4UaQ=='}, {'text': 'Binghamton, NY', 'value': '0bet33Lv2ol_M-33A5ePBg=='}, {'text': 'Bloomfield, NJ', 'value': 'QdQJH2xVwomhBgf76wBEww=='}, {'text': 'Blue Bell, PA', 'value': 'bcCJUpK8xol0o--ipPN_pg=='}, {'text': 'Bowie, MD', 'value': 'SfEGwo3qt4lVbq5KSSK3yg=='}, {'text': 'Boxborough, MA', 'value': 'T1NCC-WT44kwOMEEleJ2XQ=='}, {'text': 'Burlington, MA', 'value': 'P_ntUvj244kNqYFbrDQY7g=='}, {'text': 'California, MD', 'value': 'A-aOAy5it4nAMnKMVRkSBw=='}, {'text': 'Chalfont, PA', 'value': 'dzhnRP2mxolFy-bx8m5ySg=='}, {'text': 'Chantilly, VA', 'value': 'GXJnGVZBtomDrRZD_PBBQA=='}, {'text': 'Chevy Chase, MD', 'value': 'DxpmGHLJt4meDebirKhC0A=='}, {'text': 'Clifton, NJ', 'value': '6drDvuL-wolTMn8iM1gZZA=='}, {'text': 'Columbia, MD', 'value': 'UaBpY7Dft4ldY4e2Zb3W8A=='}, {'text': 'Concord, NH', 'value': 'F4lKFZZq4onxKCWmoHGoBQ=='}, {'text': 'Conestoga, PA', 'value': 'MeV9jGsjxokT4v65o3-mzg=='}, {'text': 'Conshohocken, PA', 'value': '10GRgV2-xomFOU14Zi0YSA=='}]}, {'type': 'Date posted', 'param': 'date_posted', 'options': [{'text': 'All'}, {'text': 'Past day', 'value': 'today'}, {'text': 'Past 3 days', 'value': '3days'}, {'text': 'Past week', 'value': 'week'}, {'text': 'Past month', 'value': 'month'}]}, {'type': 'Requirements', 'param': 'requirements', 'options': [{'text': 'All'}, {'text': 'No degree', 'value': 'no_degree'}, {'text': 'No experience', 'value': 'no_experience'}, {'text': 'Under 3 years of experience', 'value': 'years3under'}, {'text': '3+ years of experience', 'value': 'years3plus'}]}, {'type': 'Type', 'param': 'employment_type', 'options': [{'text': 'All'}, {'text': 'Full-time', 'value': 'FULLTIME'}, {'text': 'Internship', 'value': 'INTERN'}, {'text': 'Contractor', 'value': 'CONTRACTOR'}, {'text': 'Part-time', 'value': 'PARTTIME'}]}, {'type': 'Company type', 'param': 'industry.id', 'options': [{'text': 'All'}, {'text': 'Information', 'value': '/business/naics2007/51'}, {'text': 'Finance', 'value': '/business/naics2007/52'}, {'text': 'Manufacturing', 'value': '/business/naics2007/31'}, {'text': 'Retail', 'value': '/business/naics2007/44'}, {'text': 'Computer Services', 'value': '/business/naics2007/5415'}, {'text': 'Consulting', 'value': '/business/naics2007/5416'}, {'text': 'Construction', 'value': '/business/naics2007/23'}, {'text': 'Engineering Services', 'value': '/business/naics2007/5413'}, {'text': 'Education', 'value': '/business/naics2007/61'}, {'text': 'Logistics', 'value': '/business/naics2007/48'}, {'text': 'Health Care', 'value': '/business/naics2007/62'}, {'text': 'Nonprofit', 'value': '/business/naics2007/813'}, {'text': 'Staffing', 'value': '/business/naics2007/5613'}]}, {'type': 'Employer', 'param': 'organization_mid', 'options': [{'text': 'All'}, {'text': '.z1Kipd{flex:none}.NuDVRb{color:#1a73e8}', 'value': 'e'}, {'text': 'Walmart', 'value': '/m/0841v'}, {'text': 'BAE Systems', 'value': '/m/01cf6w'}, {'text': 'Epic', 'value': '/m/0bgrmg'}, {'text': 'Peraton', 'value': '/g/11g9mq8fj6'}, {'text': 'RTX', 'value': '/g/11c6qvm0kj'}, {'text': 'Datadog', 'value': '/m/0wfvvyq'}, {'text': 'Jobot', 'value': '/g/11jrq3t_g3'}, {'text': 'Ramp', 'value': '/g/11vc3pp9sw'}, {'text': 'Apple', 'value': '/m/0k8z'}, {'text': 'ClearanceJobs', 'value': '/m/09mcn9g'}, {'text': 'Etsy', 'value': '/m/0rzjz20'}, {'text': 'Intuit', 'value': '/m/04fdd3'}, {'text': 'JPMorgan Chase', 'value': '/m/01hlwv'}, {'text': 'Leidos', 'value': '/m/01h2kg'}, {'text': 'Lockheed Martin', 'value': '/m/0hkqn'}, {'text': 'Staples, Inc.', 'value': '/m/02rhj4'}, {'text': 'Boeing', 'value': '/m/0178g'}, {'text': 'CACI', 'value': '/m/0310bt'}, {'text': 'Capital One', 'value': '/m/04c_q_'}, {'text': 'Chenega Corporation', 'value': '/g/1dtslk59'}, {'text': 'Dice', 'value': '/m/02_3ckm'}, {'text': 'Duolingo', 'value': '/g/11fy1sp_cm'}, {'text': 'Expedition Technology Inc', 'value': '/g/11tdpl3rgb'}, {'text': 'GE', 'value': '/m/02ywsn'}, {'text': 'Guardian Life', 'value': '/m/0cmmlx'}, {'text': 'JBT Corporation', 'value': '/m/04gj33x'}, {'text': 'MassMutual', 'value': '/m/07f92s'}, {'text': 'Mastercard', 'value': '/m/021b7r'}, {'text': 'Meta', 'value': '/m/0hmyfsv'}, {'text': 'Pru', 'value': '/m/04fd36'}, {'text': 'Red Alpha LLC', 'value': '/g/11f01k0_b2'}, {'text': 'Siemens Digital Industries Software', 'value': '/m/011bk69h'}, {'text': 'Susquehanna International Group, LLP (SIG)', 'value': '/m/02ql0fl'}, {'text': 'Teradyne', 'value': '/m/04bzqp'}, {'text': 'Vimeo', 'value': '/m/02631wj'}, {'text': 'WARNERMEDIA', 'value': '/m/0l8sx'}, {'text': '3i Infotech Ltd.', 'value': '/m/0bwm4_h'}, {'text': '4Catalyzer', 'value': '/g/11g6__g2zw'}, {'text': 'AT&T', 'value': '/m/08z129'}, {'text': 'ActionIQ', 'value': '/g/11dxpv1lnn'}, {'text': 'AlphaSense', 'value': '/m/011v7kq3'}, {'text': 'Altamira Technologies Corp.', 'value': '/g/11f019485_'}, {'text': 'American Chemical Society', 'value': '/m/027bv9'}, {'text': 'Amplify Education, Inc.', 'value': '/m/011f3lsq'}, {'text': 'Amtrak', 'value': '/m/0dn_w'}, {'text': 'Appian', 'value': '/g/1tdn0d5l'}, {'text': 'Ascendion', 'value': '/g/11bc6n8838'}]}]}